Terraform plan for __staging__
<details>
  <summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_kms_crypto_key.crypto_key will be created
  + resource "google_kms_crypto_key" "crypto_key" {
      + id              = (known after apply)
      + key_ring        = (known after apply)
      + name            = "ebo-staging-crypto-key"
      + purpose         = "ENCRYPT_DECRYPT"
      + rotation_period = "100000s"
      + self_link       = (known after apply)

      + version_template {
          + algorithm        = (known after apply)
          + protection_level = (known after apply)
        }
    }

  # google_kms_key_ring.key_ring will be created
  + resource "google_kms_key_ring" "key_ring" {
      + id        = (known after apply)
      + location  = "asia-south1"
      + name      = "ebo-staging-key-ring"
      + project   = "ebo-staging"
      + self_link = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

Plan generated in [Terraform #122](https://github.com/ebomart/commerce-infrastructure/actions/runs/1145798844)